
export const siteData = {
  about_us: {
    title: "من نحن",
    description: "شركة الركن الملكي هي شركة متخصصة في توفير العمالة المصرية المحترفة للعمل في دول الخليج العربي. نعمل بترخيص رسمي 1415 من وزارة القوى العاملة المصرية ونلتزم بتقديم خدمات عالية الجودة قائمة على الدقة، المصداقية، الأمانة، والالتزام الكامل باحتياجات عملائنا.\nنحن نؤمن بأن نجاح أي مؤسسة يبدأ من اختيار فريق العمل المناسب؛ لذلك نحرص على اختيار أفضل الكوادر المصرية، والتأكد من جاهزيتهم، وخبراتهم، وكفاءتهم قبل إرسالهم للعمل في الخارج. كما نلتزم بتسهيل جميع الإجراءات وتوفير متابعة مستمرة حتى استلام العمالة في مقر العمل.",
    mission: {
      title: "رسالتنا",
      content: "تقديم خدمات توظيف موثوقة وسريعة، وتوفير كوادر مؤهلة تلبي احتياجات الشركات والمؤسسات في مختلف القطاعات."
    }
  },
  services: [
    {
      id: 1,
      title: "خدمة الاستقدام",
      target_audience: "الشركات والمؤسسات والأفراد",
      description: "نوفّر للشركات والمؤسسات والأفراد في دول الخليج أفضل العمالة المصرية المحترفة من خلال شركتنا الركن الملكي، مع الالتزام الكامل بمعايير الجودة والسرعة.",
      features: [
        "توفير عمالة مصرية مؤهلة وذات خبرة في جميع التخصصات",
        "تسهيل كافة إجراءات السفر والتأشيرات بسرعة واحترافية",
        "متابعة كاملة حتى وصول العامل لمكان العمل واستلامه مهامه",
        "عقود رسمية وملتزمة بالقوانين السعودية"
      ],
      contact_number: "01068888945"
    },
    {
      id: 2,
      title: "خدمة التوظيف",
      target_audience: "للمصريين فقط",
      description: "نحرص على تقديم فرص عمل حقيقية ومميزة للمصريين في في دول الخليج، من خلال شركتنا الركن الملكي مع الاهتمام الكامل بحقوقهم.",
      features: [
        "توفير فرص عمل متوافقة مع خبرتك ومهاراتك",
        "رواتب عادلة ومنافسة",
        "عقود رسمية مضمونة تحمي حقوقك",
        "متابعة ودعم مستمر حتى بعد وصولك لمكان العمل",
        "مساعدة في استخراج الأوراق والتأشيرات المطلوبة بسرعة وسهولة"
      ],
      contact_number: "01095555907"
    },
    {
      id: 3,
      title: "خدمة التعقيب",
      description: "نوفر لك خدمة تعقيب شاملة لضمان سرعة، وكفاءة إنهاء جميع الإجراءات قبل السفر للعمل في دول الخليج.",
      features: [
        "متابعة استخراج التأشيرة والفحص الطبي والبصمة",
        "تجهيز جميع العقود والمستندات الرسمية المطلوبة",
        "متابعة الإجراءات خطوة بخطوة حتى اكتمال كل الأوراق",
        "دعم مستمر وإرشادات قبل السفر لضمان راحتك",
        "توفير وقتك وجهدك وتسهيل كل التعقيدات الورقية"
      ],
      contact_number: "01050559173"
    },
    {
      id: 4,
      title: "خدمة التوثيق",
      description: "نوفر في الركن الملكي خدمة توثيق جميع الأوراق والمستندات المطلوبة للسفر والعمل في دول الخليج.",
      features: [
        "توثيق عقود العمل",
        "توثيق الشهادات الدراسية والمهنية",
        "توثيق شهادات الميلاد",
        "توثيق شهادات الخبرة",
        "توثيق السجلات التجارية",
        "توثيق المستندات الرسمية الأخرى",
        "سرعة في إنهاء التوثيق",
        "مراجعة دقيقة لجميع الأوراق",
        "ضمان قبول المستندات لدى الجهات المختصة"
      ],
      contact_number: "01050559173"
    }
  ],
  faqs: [
    {
      question: "ما هي الخدمات التي تقدمها شركة الركن الملكي؟",
      answer: "نقدم خدمات (استقدام العمالة –  التوظيف بالخارج - التعقيب -جميع التوثيقات من الجهات المعتمدة) بالإضافة إلى متابعة الطلبات وتوفير الدعم الكامل للعملاء."
    },
    {
      question: "هل الشركة مرخصة؟",
      answer: "نعم، شركة الركن الملكي تعمل بترخيص رسمي رقم (1415) لدى وزارة القوى العاملة المصرية، ونلتزم بجميع الضوابط والقوانين."
    },
    {
      question: "ما هي التخصصات التي توفرونها؟",
      answer: "نوفر كوادر مصرية مؤهلة لسوق العمل الخارجي، بما في ذلك: الأطباء - التمريض - المهندسين - المحاسبين - المحاميين - التسويق - العمالة الفنية – السائقين – الضيافة – عمال المصانع – العمالة المدربة للورش والمواقع."
    },
    {
      question: "كم تستغرق مدة إنهاء إجراءات السفر والتعاقد؟",
      answer: "تعتمد على التخصص والمتطلبات، لكن غالبًا تتراوح المدة بين 10 إلى 30 يومًا، مع متابعة يومية حتى موعد السفر."
    },
    {
      question: "هل يمكن متابعة حالة الطلب؟",
      answer: "نعم، نتيح للعميل متابعة حالة الطلب من خلال خانة الاستعلام في موقعنا."
    },
    {
      question: "هل توفرون عقود رسمية ومضمونة؟",
      answer: "نعم، جميع العقود تتم وفق القوانين المعتمدة في دول الخليج والمعتمدة من وزارة العمل المصرية، مع توثيق كامل وضمان حقوق الطرفين."
    },
    {
      question: "كيف يتم التواصل ومتابعة حالة الطلب؟",
      answer: "نوفر قنوات تواصل مباشرة عبر: الهاتف – الواتساب – الإيميل – فريق عمل متخصص لضمان سرعة الرد."
    }
  ],
  clients: [
    { name: "قطوف وحلا", logo: "/assets/clients/qotouf.png" },
    { name: "كنافة تايم", logo: "/assets/clients/kunafa-time.png" },
    { name: "حلويات سعد الدين", logo: "/assets/clients/saad-eldin.svg" },
    { name: "مؤسسة ركائز الشرق الأول للمقاولات", logo: "/assets/clients/rakaez.jpg" },
    { name: "مجموعة خالد صالح الحناكي للتجارة", logo: "/assets/clients/al-hanaki.jpeg" },
    { name: "شركة مباني الجزيرة العربية للتجارة", logo: "/assets/clients/mabani.jpeg" },
    { name: "مجموعة وضوح الرؤية", logo: "/assets/clients/wodooh.avif" },
    { name: "شركة تكنو هاوس للصناعة", logo: "/assets/clients/techno-house.jpg" },
    { name: "مؤسسة سواتر الحماية للحراسات الأمنية", logo: "/assets/clients/swater.png" },
    { name: "مكتب نايف فيصل البصيص للمحاماة", logo: "/assets/clients/naif-law.png" },
    { name: "شركة محمد هادي الرشيد وشركاه", logo: "/assets/clients/al-rasheed.png" },
    { name: "شركة بارزان للاستشارات الهندسية", logo: "/assets/clients/barzan.avif" },
    { name: "شركة العراب المتحدة للاستثمار", logo: "/assets/clients/al-arrab.jpeg" }
  ],
  contact: {
    email: "rokn.malaky@gmail.com",
    phone: "233351366",
    social_media: [
      { platform: "facebook", url: "https://www.facebook.com/royal.corner1415" },
      { platform: "instagram", url: "https://www.instagram.com/royalcorner23" },
      { platform: "tiktok", url: "https://www.tiktok.com/@elrokn.elmalaky" },
      { platform: "snapchat", url: "https://www.snapchat.com/@elroknelmalky" },
      { platform: "telegram", url: "https://t.me/RoyalCorne" }
    ]
  }
};
